# Задание 1
# 1. 1.	Определите является ли строка записью числа. (Подсказка: ищите как это сделать с помощью методов строк)
text = "Hello. How are you? What is your phone number? My is 345 46 36"
print (text.isdigit())
text = '1233560365'
print (text.isdigit())
# 1.2. Посчитåайте сколько у вас пробелов в строке
text = "Hello. How are you? What is your phone number? My is 345 46 36"
sub =' '
print(text.count(sub))
# 1.3.Посчитайте сколько у вас символов точки '.' в строке.
text = "Hello. Hi! Nice to.meet.you. Me, to."
point = '.'
print(text.count(point))
# 1.4.Создайте строку "Homework". Преобразуйте ее в строку длиной 100 символов, посередине которой исходное слово,
# а с обоих сторон строка заполнена пробелами. Выведите ее на экран.
text = 'Homework'
print(text.center(100))
#1.5.Сделайте первые буквы слов строки большими (upper case).
text = "hello. how are you? what is your number? 654 34 56 this is my number."
print(text.title())
# Задание 2
# 2.1.Вычислите длину гипотенузы в прямоугольном треугольнике со сторонами 179 и 971.
import math
a = 179
b = 971
gipotenuza = math.ceil(math.sqrt(179 ** 2 + 971 ** 2))
print(gipotenuza)
# 2.2.Дано двузначное число. Найдите число десятков в нем.
a = input("Введите число")
a = int(a)
b = a // 10
b = str(b)
print("Количество десятков в числе равно:" +(b))
# 2.3.Дано трёхзначное число. Найдите сумму его цифр.
a = 123
a = list(str(a))
b = int(str(a[0]))
c = int(str(a[1]))
d = int(str(a[2]))
print(b+c+d)
# 2.4.Дано целое число n. Выведите следующее за ним чётное число.
a = input("Введите число")
a = int(a)
b = a/2
if float.is_integer(b):
        print(a+2)
else:
        print(a+1)
# 2.5.Дано положительное действительное число X. Выведите его дробную часть.
import math
a = float(input("Введите положительное действительное число:"))
print(math.modf(a))
# 2.6. Дано положительное действительное число X. Выведите его первую цифру после десятичной точки.
a = float(input("Введите положительное действительное число:"))
print(int(a * 10)%10)
# Задание 3
# Дано целое число. Требуется определить, является ли год с данным номером високосным.
# Если год является високосным, то выведите YES, иначе выведите NO. Напомним, что в соответствии
# с григорианским календарём, год является високосным, если его номер кратен 4, но не кратен 100,
# а также если он кратен 400
a = input("Введите число(год)")
a = int(a)
if float.is_integer(a / 4 or a / 400):
    print("YES")
else:
    print("NO")
# Задание 4
# Даны три числа a, b, c. Определите, существует ли треугольник с такими сторонами.
# Если треугольник существует, выведите строку YES, иначе выведите строку NO.
a = input("Введите число- сторона а")
b = input("Введите число- сторона b")
c = input("Введите число- сторона c")
a = int(a)
b = int(b)
c = int(c)
if ((a >= (b + c)) or (b >= (a + c)) or (c >= (a + b))):
    print("NO")
else :
    print("YES")
# Задание 5
# Дано три числа. Упорядочите их в порядке возрастания. Программа должна считывать три числа a, b, c,
# затем программа должна менять их значения так, чтобы стали выполнены условия a <= b <= c,
# затем программа выводит тройку a, b, c.
# Дополнительные ограничения: нельзя использовать дополнительные переменные.
a = input("Введите число-а")
b = input("Введите число-b")
c = input("Введите число-c")
a = int(a)
b = int(b)
c = int(c)
if a > b:
   a, b = b, a
if b > c:
   b, c = c, b
if a > b:
   a, b = b, a
print(a, b, c)
# Задание 6
# Даны три целых числа. Определите, сколько среди них совпадающих.
# Программа должна вывести одно из чисел: 3 (если все совпадают),
# 2 (если два совпадает) или 0 (если все числа различны).
a = input("Введите число-1")
b = input("Введите число-2")
c = input("Введите число-c3)
a = int(a)
b = int(b)
c = int(c)
if a == b == c:
    print("3")
elif a != b and b != c and a != c:
    print("0")
else:
    print("2")

